{
  "products": [
    {
      "name": " 4K Smart TV",
      "description": "Spot of come to ever hand as lady meet on. Delicate contempt received two yet advanced. Gentleman as belonging he commanded believing dejection in by. On no am winding chicken so behaved. Its preserved sex enjoyment new way behaviour. Him yet devonshire celebrated especially. Unfeeling one provision are smallness resembled repulsive.",
      "price": 699,
      "stock": 8,
      "category": "electronic",
      "date": "2025-06-26",
      "id": "e009"
    },
    {
      "id": "e010",
      "name": "Anker Power Bank",
      "description": "10000mAh portable charger",
      "price": 35,
      "stock": 40,
      "category": "electronic",
      "date": "2025-06-26"
    },
    {
      "id": "f001",
      "name": "Apple",
      "description": "By an outlived insisted procured improved am. Paid hill fine ten now love even leaf. Supplied feelings mr of dissuade recurred no it offering honoured. Am of of in collecting devonshire favourable excellence. Her sixteen end ashamed cottage yet reached get hearing invited. Resources ourselves sweetness ye do no perfectly. Warmly warmth six one any wisdom. Family giving is pulled beauty chatty highly no. Blessing appetite domestic did mrs judgment rendered entirely. Highly indeed had garden not.",
      "price": 2,
      "stock": 100,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f002",
      "name": "Banana",
      "description": "It sportsman earnestly ye preserved an on. Moment led family sooner cannot her window pulled any. Or raillery if improved landlord to speaking hastened differed he. Furniture discourse elsewhere yet her sir extensive defective unwilling get. Why resolution one motionless you him thoroughly. Noise is round to in it quick timed doors. Written address greatly get attacks inhabit pursuit our but. Lasted hunted enough an up seeing in lively letter. Had judgment out opinions property the supplied.",
      "price": 1,
      "stock": 120,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f003",
      "name": "Orange",
      "description": "Gave read use way make spot how nor. In daughter goodness an likewise oh consider at procured wandered. Songs words wrong by me hills heard timed. Happy eat may doors songs. Be ignorant so of suitable dissuade weddings together. Least whole timed we is. An smallness deficient discourse do newspaper be an eagerness continued. Mr my ready guest ye after short at.",
      "price": 3,
      "stock": 80,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f004",
      "name": "Mango",
      "description": "Improved own provided blessing may peculiar domestic. Sight house has sex never. No visited raising gravity outward subject my cottage mr be. Hold do at tore in park feet near my case. Invitation at understood occasional sentiments insipidity inhabiting in. Off melancholy alteration principles old. Is do speedily kindness properly oh. Respect article painted cottage he is offices parlors.",
      "price": 4,
      "stock": 60,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f005",
      "name": "Pineapple",
      "description": "﻿no purse as fully me or point. Kindness own whatever betrayed her moreover procured replying for and. Proposal indulged no do do sociable he throwing settling. Covered ten nor comfort offices carried. Age she way earnestly the fulfilled extremely. Of incommode supported provision on furnished objection exquisite me. Existence its certainly explained how improving household pretended. Delightful own attachment her partiality unaffected occasional thoroughly. Adieus it no wonder spirit houses.",
      "price": 5,
      "stock": 50,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f006",
      "name": "Strawberry",
      "description": "Acceptance middletons me if discretion boisterous travelling an. She prosperous continuing entreaties companions unreserved you boisterous. Middleton sportsmen sir now cordially ask additions for. You ten occasional saw everything but conviction. Daughter returned quitting few are day advanced branched. Do enjoyment defective objection or we if favourite. At wonder afford so danger cannot former seeing. Power visit charm money add heard new other put. Attended no indulged marriage is to judgment offering landlord.",
      "price": 6,
      "stock": 70,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f008",
      "name": "Watermelon",
      "description": "Large sweet watermelon",
      "price": 7,
      "stock": 30,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f009",
      "name": "Papaya",
      "description": "Saw yet kindness too replying whatever marianne. Old sentiments resolution admiration unaffected its mrs literature. Behaviour new set existence dashwoods. It satisfied to mr commanded consisted disposing engrossed. Tall snug do of till on easy. Form not calm new fail.",
      "price": 4,
      "stock": 45,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "f010",
      "name": "Peach",
      "description": "You disposal strongly quitting his endeavor two settling him. Manners ham him hearted hundred expense. Get open game him what hour more part. Adapted as smiling of females oh me journey exposed concern. Met come add cold calm rose mile what. Tiled manor court at built by place fanny. Discretion at be an so decisively especially. Exeter itself object matter if on mr in.",
      "price": 3,
      "stock": 55,
      "category": "fruit",
      "date": "2025-06-26"
    },
    {
      "id": "h001",
      "name": "Vitamin C Tablets",
      "description": "He went such dare good mr fact. The small own seven saved man age ﻿no offer. Suspicion did mrs nor furniture smallness. Scale whole downs often leave not eat. An expression reasonably cultivated indulgence mr he surrounded instrument. Gentleman eat and consisted are pronounce distrusts.",
      "price": 15,
      "stock": 100,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "h002",
      "name": "First Aid Kit",
      "description": "Doubtful two bed way pleasure confined followed. Shew up ye away no eyes life or were this. Perfectly did suspicion daughters but his intention. Started on society an brought it explain. Position two saw greatest stronger old. Pianoforte if at simplicity do estimating.",
      "price": 25,
      "stock": 40,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "h003",
      "name": "Digital Thermometer",
      "description": "Oh to talking improve produce in limited offices fifteen an. Wicket branch to answer do we. Place are decay men hours tiled. If or of ye throwing friendly required. Marianne interest in exertion as. Offering my branched confined oh dashwood.",
      "price": 12,
      "stock": 60,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "h004",
      "name": "Face Mask (50 pcs)",
      "description": "Enjoyed minutes related as at on on. Is fanny dried as often me. Goodness as reserved raptures to mistaken steepest oh screened he. Gravity he mr sixteen esteems. Mile home its new way with high told said. Finished no horrible blessing landlord dwelling dissuade if. Rent fond am he in on read. Anxious cordial demands settled entered in do to colonel.",
      "price": 10,
      "stock": 200,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "h007",
      "name": "Multivitamins",
      "description": "Open know age use whom him than lady was. On lasted uneasy exeter my itself effect spirit. At design he vanity at cousin longer looked ye. Design praise me father an favour. As greatly replied it windows of an minuter behaved passage. Diminution expression reasonable it we he projection acceptance in devonshire. Perpetual it described at he applauded.",
      "price": 20,
      "stock": 90,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "h008",
      "name": "Glucose Monitor",
      "description": "Now eldest new tastes plenty mother called misery get. Longer excuse for county nor except met its things. Narrow enough sex moment desire are. Hold who what come that seen read age its. Contained or estimable earnestly so perceived. Imprudence he in sufficient cultivated. Delighted promotion improving acuteness an newspaper offending he. Misery in am secure theirs giving an. Design on longer thrown oppose am.",
      "price": 30,
      "stock": 25,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "h009",
      "name": "Fitness Tracker Band",
      "description": "Received the likewise law graceful his. Nor might set along charm now equal green. Pleased yet equally correct colonel not one. Say anxious carried compact conduct sex general nay certain. Mrs for recommend exquisite household eagerness preserved now. My improved honoured he am ecstatic quitting greatest formerly.",
      "price": 49,
      "stock": 40,
      "category": "health",
      "date": "2025-06-26"
    },
    {
      "id": "da79",
      "name": "Ahmad ",
      "description": "khan",
      "price": 90,
      "stock": 6,
      "category": "electronics",
      "date": "2025-06-26"
    },
    {
      "id": "322c",
      "name": "emran",
      "description": "khan",
      "price": 90,
      "stock": 90,
      "category": "other",
      "date": "2025-01-01"
    },
    {
      "id": "ce43",
      "name": "Computer",
      "description": "Dell computer every user can use this computer",
      "price": 900.5,
      "stock": 10,
      "category": "health",
      "date": "2025-06-27"
    },
    {
      "id": "c556",
      "name": "Wasim Khan",
      "description": "Wasim Khan information",
      "price": 900,
      "stock": 10,
      "category": "electronic",
      "date": "2025-06-27"
    },
    {
      "id": "149a",
      "name": "Wasim",
      "description": "khan",
      "price": 900,
      "stock": 90,
      "category": "electronic",
      "date": "2025-01-01"
    },
    {
      "id": "9b77",
      "name": "Laptop",
      "description": "RTX 5050",
      "price": 10000,
      "stock": 10,
      "category": "other",
      "date": "2025-07-01"
    },
    {
      "id": "6a68",
      "name": "testing after changes",
      "description": "this is  the desc",
      "price": 10,
      "stock": 1000,
      "category": "fruit",
      "date": "2025-06-17"
    },
    {
      "id": "ce42",
      "name": "refetch test",
      "description": "test refetch desc",
      "price": 23423,
      "stock": 34234,
      "category": "fruit",
      "date": "2025-06-16"
    }
  ]
}